## Read data from sources using pandas

In [9]:
import pandas as pd
from io import StringIO
Data = '{"employee_name": "James", "email": "james@gmail.com", "job_profile": [{"title":"Team Lead", "title2": "Sr. Developer"}]}'
df=pd.read_json(StringIO(Data))

In [11]:
df

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title': 'Team Lead', 'title2': 'Sr. Developer'}"

In [15]:
df.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title":"Team Lead","title2":"Sr. Developer"}}}'

In [19]:
df.to_json(orient='index')  # default is index

'{"0":{"employee_name":"James","email":"james@gmail.com","job_profile":{"title":"Team Lead","title2":"Sr. Developer"}}}'

In [21]:
df.to_json(orient='records')

'[{"employee_name":"James","email":"james@gmail.com","job_profile":{"title":"Team Lead","title2":"Sr. Developer"}}]'

In [33]:
df=pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data",header=None)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [37]:
df.to_csv("wine") #csv file had beeen created from url

In [39]:
!pip install lxml

Requirement already satisfied: lxml in e:\software\ide\anaconda\lib\site-packages (5.2.1)

In [41]:
url="https://www.fdic.gov/bank/individual/failed/banklist.html"
df=pd.read_html(url)

In [43]:
df

[                               Bank Name               City         State  \
 0                   Pulaski Savings Bank            Chicago      Illinois
 1     The First National Bank of Lindsay            Lindsay      Oklahoma
 2  Republic First Bank dba Republic Bank       Philadelphia  Pennsylvania
 3                          Citizens Bank           Sac City          Iowa
 4               Heartland Tri-State Bank            Elkhart        Kansas
 5                    First Republic Bank      San Francisco    California
 6                         Signature Bank           New York      New York
 7                    Silicon Valley Bank        Santa Clara    California
 8                      Almena State Bank             Almena        Kansas
 9             First City Bank of Florida  Fort Walton Beach       Florida

     Cert                Acquiring Institution      Closing Date  \
 0  28611                      Millennium Bank  January 17, 2025
 1   4134   First Bank & Trust Co., Duncan, OK  October 18, 2024
 2  27332    Fulton Bank, National Association    April 26, 2024
 3   8758            Iowa Trust & Savings Bank  November 3, 2023
 4  25851               Dream First Bank, N.A.     July 28, 2023
 5  59017            JPMorgan Chase Bank, N.A.       May 1, 2023
 6  57053                  Flagstar Bank, N.A.    March 12, 2023
 7  24735  First Citizens Bank & Trust Company    March 10, 2023
 8  15426                          Equity Bank  October 23, 2020
 9  16748            United Fidelity Bank, fsb  October 16, 2020

    Fund  Sort ascending
 0                 10548
 1                 10547
 2                 10546
 3                 10545
 4                 10544
 5                 10543
 6                 10540
 7                 10539
 8                 10538
 9                 10537  ]

In [49]:
!pip install html5lib
!pip install beautifulsoup4

Requirement already satisfied: html5lib in e:\software\ide\anaconda\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in e:\software\ide\anaconda\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in e:\software\ide\anaconda\lib\site-packages (from html5lib) (0.5.1)
Requirement already satisfied: beautifulsoup4 in e:\software\ide\anaconda\lib\site-packages (4.12.3)
Requirement already satisfied: soupsieve>1.2 in e:\software\ide\anaconda\lib\site-packages (from beautifulsoup4) (2.5)

In [53]:
url="https://en.wikipedia.org/wiki/Mobile_country_code"
pd.read_html(url, match="Country", header=0)
# to print the table which has the keyword Country

[     Mobile country code                                    Country ISO 3166  \
 0                    289                                 A Abkhazia    GE-AB
 1                    412                                Afghanistan       AF
 2                    276                                    Albania       AL
 3                    603                                    Algeria       DZ
 4                    544  American Samoa (United States of America)       AS
 ..                   ...                                        ...      ...
 247                  452                                    Vietnam       VN
 248                  543                        W Wallis and Futuna       WF
 249                  421                                    Y Yemen       YE
 250                  645                                   Z Zambia       ZM
 251                  648                                   Zimbabwe       ZW

                                   Mobile network codes National MNC authority  \
 0             List of mobile network codes in Abkhazia                    NaN
 1          List of mobile network codes in Afghanistan                    NaN
 2              List of mobile network codes in Albania                    NaN
 3              List of mobile network codes in Algeria                    NaN
 4       List of mobile network codes in American Samoa                    NaN
 ..                                                 ...                    ...
 247        List of mobile network codes in the Vietnam                    NaN
 248  List of mobile network codes in Wallis and Futuna                    NaN
 249          List of mobile network codes in the Yemen                    NaN
 250             List of mobile network codes in Zambia                    NaN
 251           List of mobile network codes in Zimbabwe                    NaN

                       Remarks
 0    MCC is not listed by ITU
 1                         NaN
 2                         NaN
 3                         NaN
 4                         NaN
 ..                        ...
 247                       NaN
 248                       NaN
 249                       NaN
 250                       NaN
 251                       NaN

 [252 rows x 6 columns]]

In [59]:
df_excel= pd.read_excel('data.xlsx')  #pip install openpyxl

In [61]:
df_excel

    name  age
0  krish   32
1   jack   34
2   john   43

In [67]:
df_excel.to_pickle('df_pickle')

In [69]:
pd.read_pickle('df_pickle')

    name  age
0  krish   32
1   jack   34
2   john   43